-----------------------------
-- Управление

BUTTON_UP    = 0
BUTTON_DOWN  = 1
BUTTON_LEFT  = 2
BUTTON_RIGHT = 3

-- Дежук только

KEY_W = 23
KEY_A = 01
KEY_S = 19
KEY_D = 04

--[[

Таблица переводов кнопок контроллеров.
Кто-то же должен это делать 🤓

+------+-----------+----------+-----------+
| XBOX |    PS4    | Keyboard | Direction |
+------+-----------+----------+-----------+
|  A   |  cross    |    z     |   south   |
|  B   |  circle   |    x     |   east    |
|  X   |  square   |    a     |   west    |
|  Y   |  triangle |    s     |   north   |
+------+-----------+----------+-----------+

]]--

BUTTON_A = 4
BUTTON_B = 5
BUTTON_X = 6
BUTTON_Y = 7

-----------------------------

-----------------------------
-- Режимы игры

GAMEMODE_DEBUG = 'creative'
GAMEMODE_RELEASE = 'survival'